# PortraitLayout Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DWFExportOptions..::..PortraitLayout Property
DWFExportOptions Class See Also
---
Paper orientation - Portrait/Landscape.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool PortraitLayout { get; set; }
```

Visual Basic
---
```text
Public Property PortraitLayout As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool PortraitLayout {
	bool get ();
	void set (bool value);
}
```

# See Also
DWFExportOptions Class
Autodesk.Revit.DB Namespace